04-conditionals.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>04-conditionals</title>
<!-- 2021-02-13 Sat 14:10 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">04-conditionals</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Conditionals</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Conditionals</h2>
<div class="outline-text-2" id="text-1">
<p>
Conditionals are one of the most common tools in programming. The simplest form looks like this:
</p>

<div class="org-src-container">

<pre class="src src-js">if (condition) {
  console.log('the condition is true!');
}
</pre>
</div>

<p>
The condition goes inside the round brackets after 'if'. The code that we want to run if the condition is true goes in the curly brackets.
</p>

<p>
<code>=</code>
&amp;&amp;
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
<p>
!
</p>

<p>
NUMBERS
&gt;
&gt;=
&lt;
&lt;=
</p>

<p>
Just like in plain English, we can say "If I have less than 5 apples, then I should go buy some more."
</p>

<div class="org-src-container">

<pre class="src src-js">const apples = 2;
if (apples &lt; 5) {
  console.log('I should go buy more apples.');
}
</pre>
</div>

<p>
The condition is "I have less than 5 apples" and if that condition is true, then I should go buy some more. The condition "I have less than 5 apples" is either true or false, regardless of what I know about my apples (even if I haven't checked how many apples I have in the kitchen). That's the way it works with computers. The condition must be either true or false.
</p>

<p>
If I instead want to catch the case where the condition is false, I can check the opposite.
</p>

<div class="org-src-container">

<pre class="src src-js">const apples = 2;
if (apples &gt;= 5) {
  console.log('I should go buy more apples.');
}
</pre>
</div>

<div class="org-src-container">

<pre class="src src-js">const apples = 2;
if (!(apples &lt; 5)) {
  console.log('I should go buy more apples.');
}
</pre>
</div>

<p>
Both of these blocks of code do the same thing.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-02-13 Sat 14:10</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
